//-----------------------------Последнее значение цикла
let i = 3;

while (i) {
  alert( i-- );
}// Последнее число будет 0





//-----------------------------Какие значения выведет цикл while?
let i = 0;
while (++i < 5) alert( i ); // Выведет 1-4 

let i = 0;
while (i++ < 5) alert( i ); // Выведет 1-5 

//-----------------------------Какие значения выведет цикл for?
for (let i = 0; i < 5; i++) alert( i ); // Выведет 0-4 

for (let i = 0; i < 5; ++i) alert( i ); // Выведет 0-4 





//-----------------------------Выведите чётные числа
for (let i = 2; i <= 10; i++) {
    if (i % 2 == 0) {
      alert( i );
    }
  }





//-----------------------------Замените for на while
let i = 0;
while (i < 3) {
  alert( `number ${i}!` );
  i++;
}




//-----------------------------Повторять цикл, пока ввод неверен
let num;

do {
  num = prompt("Введите число больше 100?", 0);
} while (num <= 100 && num);




//-----------------------------Вывести простые числа
nextPrime:
for (let i = 2; i <= 10; i++) { 
  for (let j = 2; j < i; j++) {
    if (i % j == 0) continue nextPrime; 
  }

  alert( i ); 
}